tobozo/ESP32-USB-Soft-Host/src/usb_host.c
#include <stdint.h>
#include <stddef.h>
#include <stdlib.h>
#include <sys/cdefs.h>
#include <stdio.h>
#include <time.h>
#include <sys/time.h>
#include <string.h>


#include "usb_host.h"
#ifdef ESP32
#include "driver/gpio.h"
#include "sdkconfig.h"
#include "driver/timer.h"
#include "soc/soc.h"
#include "soc/rtc.h"
#include "math.h"
#include "esp_heap_caps.h"
#include "esp32-hal.h"

inline uint32_t hal_get_cpu_mhz(void)
{
  rtc_cpu_freq_config_t  out_config;
  rtc_clk_cpu_freq_get_config(&out_config);
  return out_config.freq_mhz;
}

#ifdef TIMER_INTERVAL0_SEC
typedef void (*timer_isr_t)(void *para);

void hal_timer_setup(timer_idx_t timer_num, uint32_t alarm_value, timer_isr_t timer_isr)
{
  timer_config_t config;
  config.divider     = TIMER_DIVIDER;
  config.counter_dir = TIMER_COUNT_UP;
  config.counter_en  = TIMER_PAUSE;
  config.alarm_en    = TIMER_ALARM_EN;
  config.auto_reload = (timer_autoreload_t) 1; // fix for ¬invalid conversion from 'int' to 'timer_autoreload_t'¬ thanks rudi ;-)

  timer_init(TIMER_GROUP_0, timer_num, &config);
  timer_set_counter_value(TIMER_GROUP_0, timer_num, 0x00000000ULL);
  timer_set_alarm_value(TIMER_GROUP_0, timer_num, alarm_value);
  timer_enable_intr(TIMER_GROUP_0, timer_num);
  timer_isr_register(TIMER_GROUP_0, timer_num, timer_isr, (void *) timer_num, ESP_INTR_FLAG_IRAM, NULL);
  timer_start(TIMER_GROUP_0, timer_num);
}
#endif

#define cpu_hal_get_cycle_count xthal_get_ccount
#else
#include <Arduino.h>
#endif //ESP32

#ifdef USE_TUSB_FIFO
hal_queue_handle_t hal_queue_create(size_t n, size_t sz, void *buffer)
{
  tu_fifo_t f;
  memset(&f, 0, sizeof(f));
  tu_fifo_config(&f, buffer, n, sz, true);
  return f;
}
#endif


/*******************************
*    warning!!!: any copy of this code or his part must include this:
*  "The original was written by Dima Samsonov @ Israel sdima1357@gmail.com on 3/2021" *
*  Copyright (C) 2021  Dmitry Samsonov *
********************************/

/*\
   Changes by tobozo (sept 2021)
     - Backported commits from https://github.com/sdima1357/esp32_usb_soft_host/commit/7c51138ec1ea37d4dd5363d3f25a8e7ab8716871
     - ESP32-C3 can't work with Arduino IDE ( CONFIG_ESP_SYSTEM_MEMPROT_FEATURE=y ), C++ wrapper still valid through platformio/esp-idf though
   Changes by tobozo (may 2021):
     - Backported calibration at init (last changes from from Samsonov's repo)
   Changes by tobozo (march 2021):
     - Arduino IDE compliance (mostly code regression to esp-idf 3.x)
     - Added callbacks (data and device detection)
\*/

// Arduino IDE complains about volatile at init, but we don't care
#pragma GCC diagnostic ignored "-Wdiscarded-qualifiers"


#define T_START   0b00000001
#define T_ACK     0b01001011
#define T_NACK    0b01011010
#define T_SOF    0b10100101
#define T_SETUP  0b10110100
#define T_DATA0  0b11000011
#define T_DATA1  0b11010010
#define T_DATA2  0b11100001
#define T_OUT    0b10000111
#define T_IN    0b10010110

#define T_ERR    0b00111100
#define T_PRE    0b00111100
#define T_NYET  0b01101001
#define T_STALL  0b01111000

// local non std
#define T_NEED_ACK   0b01111011
#define T_CHK_ERR    0b01111111

#define USB_LS_K  0
#define USB_LS_J  1
#define USB_LS_S  2

//most counters- uint_8t :  so  prevents overflow...

#define DEF_BUFF_SIZE 0x100

// somethins short  like ACK
#define SMALL_NO_DATA 36




int TRANSMIT_TIME_DELAY = 110;  //delay each bit transmit
int TIME_MULT           = 25;    //received time factor delta clocks* TIME_MULT/TIME_SCALE
int TM_OUT              = 64;    //receive time out no activity on bus
#define  TIME_SCALE       1024

//#define TEST
#ifdef TEST
  #define TOUT  1000
#else
  #define TOUT  (TM_OUT)
#endif


//aproximate scale depending on CPU clock frequency
#if   F_CPU <   50*1000000
#define TIME_FACTOR_BITS 0
#elif F_CPU <  100*1000000
#define TIME_FACTOR_BITS 1
#elif F_CPU <  200*1000000
#define TIME_FACTOR_BITS 2
#elif F_CPU <  400*1000000
#define TIME_FACTOR_BITS 3
#elif F_CPU <  800*1000000
#define TIME_FACTOR_BITS 4
#elif F_CPU < 1600*1000000
#define TIME_FACTOR_BITS 5
#else
#define TIME_FACTOR_BITS 6
#endif

static uint32_t _getCycleCount32()
{
  uint32_t ccount = cpu_hal_get_cycle_count();
  return  ccount;
}
static uint8_t _getCycleCount8d8(void)
{
  uint32_t ccount = _getCycleCount32();
  return ccount>>TIME_FACTOR_BITS;
}


#if 0//def ESP32

//#define SE_J  { *snd[1][0] = (1 << DM_PIN);*snd[1][1] = (1 << DP_PIN); } //clear / set
//#define SE_0  { *snd[2][0] = (1 << DM_PIN);*snd[2][1] = (1 << DP_PIN); } //clear / clear

#if CONFIG_IDF_TARGET_ESP32
  #define SET_I(dp, dm) { PIN_INPUT_ENABLE(GPIO_PIN_MUX_REG[dp]); PIN_INPUT_ENABLE(GPIO_PIN_MUX_REG[dm]); GPIO.enable_w1tc = (1 << (dp)) | (1 << (dm));  }
  #define SET_O(dp, dm) { GPIO.enable_w1ts = (1 << (dp)) | (1 << (dm));  PIN_INPUT_DISABLE(GPIO_PIN_MUX_REG[dp]); PIN_INPUT_DISABLE(GPIO_PIN_MUX_REG[dm]);  }
  #define READ_BOTH_PINS (((GPIO.in&RD_MASK)<<8)>>RD_SHIFT)
  uint32_t * snd[4][2]  =
  {
    {&GPIO.out_w1tc,&GPIO.out_w1ts}, //clear / set
    {&GPIO.out_w1ts,&GPIO.out_w1tc}, //set   / clear
    {&GPIO.out_w1tc,&GPIO.out_w1tc}, //clear / clear
    {&GPIO.out_w1tc,&GPIO.out_w1tc}  //clear / clear
  } ;
#else
  //gpio_ll_output_disable: hw->enable_w1tc = (0x1 << gpio_num);
  //GPIO_PIN_MUX_REG[0]: IO_MUX_GPIO0_REG
  //PIN_INPUT_ENABLE(PIN_NAME): SET_PERI_REG_MASK(PIN_NAME,FUN_IE)
  #define SET_I(dp, dm) { PIN_INPUT_ENABLE(GPIO_PIN_MUX_REG[dp]); PIN_INPUT_ENABLE(GPIO_PIN_MUX_REG[dm]);  gpio_ll_output_disable(&GPIO,dm); gpio_ll_output_disable(&GPIO,dp);}
  #define SET_O(dp, dm) { GPIO.enable_w1ts.val = (1 << (dp)) | (1 << (dm));  PIN_INPUT_DISABLE(GPIO_PIN_MUX_REG[dp]); PIN_INPUT_DISABLE(GPIO_PIN_MUX_REG[dm]);  }
  #define READ_BOTH_PINS (((GPIO.in.val&RD_MASK)<<8)>>RD_SHIFT)
  uint32_t * snd[4][2]  =
  {
    {&GPIO.out_w1tc.val,&GPIO.out_w1ts.val},
    {&GPIO.out_w1ts.val,&GPIO.out_w1tc.val},
    {&GPIO.out_w1tc.val,&GPIO.out_w1tc.val},
    {&GPIO.out_w1tc.val,&GPIO.out_w1tc.val}
  } ;

#endif
#endif

#warning assumes DM_PIN > DP_PIN
#ifndef READ_BOTH_PINS
#define READ_BOTH_PINS ((hal_gpio_read(DM_PIN) ? 1<<(8+DM_PIN - DP_PIN) : 0) | (hal_gpio_read(DP_PIN) ? 0x100 : 0))
#endif
#ifndef SET_I
#define SET_I(dp, dm)  { hal_gpio_set_direction(dp, 0); hal_gpio_set_direction(dm, 0); }
#endif
#ifndef SET_O
#define SET_O(dp, dm)  { hal_gpio_set_direction(dp, 1); hal_gpio_set_direction(dm, 1); }
#endif
#ifndef SE_J 
#define SE_J { hal_gpio_set_level(DM_PIN, 0); hal_gpio_set_level(DP_PIN, 1); } //clear / set
#endif
#ifndef SE_0 
#define SE_0 { hal_gpio_set_level(DM_PIN, 0); hal_gpio_set_level(DP_PIN, 0); } //clear / clear
#endif

#define hal_set_differential_gpio_value(dp, dm,v) \
{ hal_gpio_set_level(dm, v & 1); /*v==0 => clear, v==1 => set,   v == 2 => clear*/ \
    hal_gpio_set_level(dp, v == 0); } /*v==0 => set  , v==1 => clear, v == 2 => clear */


