tobozo/ESP32-USB-Soft-Host/src/usb_host.c
//must be setup ech time with setPins
uint32_t DP_PIN;
uint32_t DM_PIN;

uint32_t DM_PIN_M;
uint32_t DP_PIN_M;
uint16_t M_ONE;
uint16_t P_ONE;
uint32_t RD_MASK;
uint32_t RD_SHIFT;
//end must be setup ech time with setPins

// temporary used insize lowlevel
volatile uint8_t received_NRZI_buffer_bytesCnt;
uint16_t received_NRZI_buffer[DEF_BUFF_SIZE];

volatile uint8_t transmit_bits_buffer_store_cnt;
//uint8_t transmit_bits_buffer_store[DEF_BUFF_SIZE];
uint8_t* transmit_bits_buffer_store = (uint8_t*)&received_NRZI_buffer[0];

volatile uint8_t transmit_NRZI_buffer_cnt;
uint8_t transmit_NRZI_buffer[DEF_BUFF_SIZE];

volatile uint8_t decoded_receive_buffer_head;
volatile uint8_t decoded_receive_buffer_tail;
uint8_t decoded_receive_buffer[DEF_BUFF_SIZE];
// end temporary used insize lowlevel

#ifdef ESP32
void (*delay_pntA)() = NULL;
#define cpuDelay(x) {(*delay_pntA)();}


#if CONFIG_IDF_TARGET_ESP32
  #define MAX_DELAY_CODE_SIZE 0x280
  #define SDELAYMALLOC(X) malloc(X)
  #define SDELAYREALLOC(X,Y,Z) heap_caps_realloc(X,Y,Z)
  #define SDELAYRMASK MALLOC_CAP_EXEC
  void makeOpcodes( uint8_t* ptr, uint8_t ticks )
  {
    //put head of delay procedure
    *ptr++ = 0x36;
    *ptr++ = 0x41;
    *ptr++ = 0;
    for(int k=0;k<ticks;k++) {
      //put NOPs
      *ptr++ = 0x3d;
      *ptr++ = 0xf0;
    }
    //put tail of delay procedure
    *ptr++ = 0x1d;
    *ptr++ = 0xf0;
    *ptr++ = 0x00;
    *ptr++ = 0x00;
  }
#else // ESP32-C3
  #define MAX_DELAY_CODE_SIZE 0x210
  #define SDELAYMALLOC(X) heap_caps_aligned_alloc(X,MAX_DELAY_CODE_SIZE, MALLOC_CAP_8BIT);
  #define SDELAYREALLOC(X,Y,Z) heap_caps_realloc(X,Y,Z)
  #define SDELAYRMASK MALLOC_CAP_32BIT | MALLOC_CAP_EXEC
  void makeOpcodes( uint8_t* ptr, uint8_t ticks )
  {
    //put head of delay procedure
    for(int k=0;k<ticks;k++) {
      //put NOPs
      *ptr++ = 0x1;
      *ptr++ = 0x0;
    }
    //put tail of delay procedure
    *ptr++ = 0x82;
    *ptr++ = 0x80;
  }
#endif


void setDelay(uint16_t ticks)
{
  uint8_t* pntS;
  if(ticks > MAX_DELAY_CODE_SIZE)
    ticks = MAX_DELAY_CODE_SIZE;
  // it can't execute but can read & write
  if(!delay_pntA) {
    pntS = SDELAYMALLOC( MAX_DELAY_CODE_SIZE );
  } else {
    pntS = SDELAYREALLOC( delay_pntA, MAX_DELAY_CODE_SIZE, MALLOC_CAP_8BIT );
  }
  uint8_t* pnt = (uint8_t*)pntS;
  makeOpcodes( pnt, ticks );
  // move it to executable memory segment
  // it can't  write  but can read & execute
  delay_pntA = SDELAYREALLOC( pntS, MAX_DELAY_CODE_SIZE, SDELAYRMASK );
  if(!delay_pntA) {
    printf("idf.py menuconfig\n Component config-> ESP System Setting -> Memory protectiom-> Disable.\n memory prot must be disabled!!!\n delay_pntA = %p,\nHalting...\n",delay_pntA);
    while(1) { vTaskDelay(1); }
  }
}
#else //not ESP32

void setDelay(uint16_t ticks) {}
void cpuDelay(uint16_t x)
{
 uint32_t t0 = cpu_hal_get_cycle_count();
 for(;;)
 {
   uint32_t t1 =  cpu_hal_get_cycle_count();
   t1 -= t0;
   if(t1 > x)
     break;
  }
}
#endif



typedef struct
{
  uint8_t cmd;
  uint8_t addr;
  uint8_t eop;

  uint8_t  dataCmd;
  uint8_t  bmRequestType;
  uint8_t  bmRequest;
  uint16_t wValue;
  uint16_t wIndex;
  uint16_t wLen;
} Req;



enum DeviceState
{
  NOT_ATTACHED,
  ATTACHED,
  POWERED,
  DEFAULT,
  ADDRESS,
  PARSE_CONFIG,
  PARSE_CONFIG1,
  PARSE_CONFIG2,
  PARSE_CONFIG3,
  POST_ATTACHED,
  RESET_COMPLETE,
  POWERED_COMPLETE,
  DEFAULT_COMPL
};



enum CallbackCmd
{
  CB_CHECK,
  CB_RESET,
  CB_WAIT0,
  CB_POWER,
  CB_TICK,
  CB_2,
  CB_2Ack,
  CB_3,
  CB_4,
  CB_5,
  CB_6,
  CB_7,
  CB_8,
  CB_9,
  CB_WAIT1
};



//Req rq;
typedef struct
{
  int isValid;
  int selfNum;
  int epCount;
  int cnt;

  uint8_t flags_new;
  uint8_t flags;

  uint32_t DP;
  uint32_t DM;

  volatile enum CallbackCmd cb_Cmd;
  volatile enum DeviceState fsm_state;
  volatile uint16_t wires_last_state;

  sDevDesc desc;
  sCfgDesc cfg;
  Req rq;

  int counterNAck;
  int counterAck;

  uint8_t descrBuffer[DEF_BUFF_SIZE];
  uint8_t descrBufferLen;

  volatile int bComplete;
  volatile int in_data_flip_flop;

  int cmdTimeOut;

  uint32_t ufPrintDesc;
  int numb_reps_errors_allowed;

  uint8_t acc_decoded_resp[DEF_BUFF_SIZE];
  uint8_t acc_decoded_resp_counter;

  int asckedReceiveBytes;
  int transmitL1Bytes;
  uint8_t transmitL1[DEF_BUFF_SIZE];

} sUsbContStruct;

sUsbContStruct * current;
void usb_disable_current() { current->isValid = 0; }

void parseImmed(sUsbContStruct * pcurrent)
{
  static sCfgDesc      cfg;
  static sIntfDesc     sIntf;
  static HIDDescriptor hid[4];
  static sEPDesc       epd;
  /*static int           cfgCount   = 0;
  static int           sIntfCount   = 0;*/
  static int           hidCount   = 0;
  int                  pos = 0;
  #define STDCLASS     0x00
  #define HIDCLASS     0x03
  #define HUBCLASS     0x09      /* bDeviceClass, bInterfaceClass */

  pcurrent->epCount     = 0;

  while(pos<pcurrent->descrBufferLen-2) {
    uint8_t len  =  pcurrent->descrBuffer[pos];
    uint8_t type =  pcurrent->descrBuffer[pos+1];
    if(len==0) {
      //printf("pos = %02x type = %02x cfg.wLength = %02x pcurrent->acc_decoded_resp_counter = %02x\n ",pos,type,cfg.wLength,pcurrent->acc_decoded_resp_counter);
      pos = pcurrent->descrBufferLen;
    }
    if(pos+len<=pcurrent->descrBufferLen) {
      if(type == 0x2) {
        memcpy(&cfg,&pcurrent->descrBuffer[pos],len);

      } else if (type == 0x4) {
        memcpy(&sIntf,&pcurrent->descrBuffer[pos],len);
      } else if (type == 0x21) {
        hidCount++;
        int i = hidCount-1;
        memcpy(&hid[i],&pcurrent->descrBuffer[pos],len);
      } else if (type == 0x5) {
        pcurrent->epCount++;
        memcpy(&epd,&pcurrent->descrBuffer[pos],len);
      }
    }
    pos+=len;
  }
}

#ifdef WR_SIMULTA
uint32_t sndA[4]  = {0,0,0,0};
#endif



void restart()
{
  transmit_NRZI_buffer_cnt = 0;
}



void decoded_receive_buffer_clear()
{
  decoded_receive_buffer_tail = decoded_receive_buffer_head;
}



void decoded_receive_buffer_put(uint8_t val)
{
  decoded_receive_buffer[decoded_receive_buffer_head] = val;
  decoded_receive_buffer_head++;
}



uint8_t decoded_receive_buffer_get()
{
  return decoded_receive_buffer[decoded_receive_buffer_tail++];
}



uint8_t decoded_receive_buffer_size()
{
  return (uint8_t )(decoded_receive_buffer_head-decoded_receive_buffer_tail);
}



