tobozo/ESP32-USB-Soft-Host/src/usb_host.c
uint8_t cal5()
{
  uint8_t   crcb;
  uint8_t   rem;

  crcb = 0b00101;
  rem =  0b11111;

  for(int k=16;k<transmit_bits_buffer_store_cnt;k++) {
    int rb = (rem>>4)&1;
    rem   =  (rem<<1)&0b11111;

    if(rb^(transmit_bits_buffer_store[k]&1)) {
      rem ^= crcb;
    }
  }
  return (~rem)&0b11111;
}



uint32_t cal16()
{
  uint32_t   crcb;
  uint32_t   rem;

  crcb = 0b1000000000000101;
  rem =  0b1111111111111111;

  for(int k=16;k<transmit_bits_buffer_store_cnt;k++) {
    int rb = (rem>>15)&1;
    rem   =  (rem<<1)&0b1111111111111111;

    if(rb^(transmit_bits_buffer_store[k]&1)) {
      rem ^= crcb;
    }
  }
  return (~rem)&0b1111111111111111;
}



void seB(int bit)
{
  transmit_bits_buffer_store[transmit_bits_buffer_store_cnt++] = bit;
}



void pu_MSB(uint16_t msg,int N)
{
  for(int k=0;k<N;k++) {
    seB(msg&(1<<(N-1-k))?1:0);
  }
}



void pu_LSB(uint16_t msg,int N)
{
  for(int k=0;k<N;k++) {
    seB(msg&(1<<(k))?1:0);
  }
}



void repack()
{
  int last = USB_LS_J;
  int cntOnes = 0;
  transmit_NRZI_buffer[transmit_NRZI_buffer_cnt++] = USB_LS_J;
  for(int k=0;k<transmit_bits_buffer_store_cnt;k++) {
    if(transmit_bits_buffer_store[k]==0) {
      if(last==USB_LS_J||last==USB_LS_S) {
        last = USB_LS_K;
      } else {
        last = USB_LS_J;
      }
      cntOnes = 0;
    } else if(transmit_bits_buffer_store[k]==1) {
      cntOnes++;
      if(cntOnes==6) {
        transmit_NRZI_buffer[transmit_NRZI_buffer_cnt] = last;
        transmit_NRZI_buffer_cnt++;
        if(last==USB_LS_J) {
          last = USB_LS_K;
        } else {
          last = USB_LS_J;
        }
        cntOnes = 0;
      }
      if(last==USB_LS_S) {
        last = USB_LS_J;
      }
    }
    transmit_NRZI_buffer[transmit_NRZI_buffer_cnt++] = last;
  }

  transmit_NRZI_buffer[transmit_NRZI_buffer_cnt++] = USB_LS_S;
  transmit_NRZI_buffer[transmit_NRZI_buffer_cnt++] = USB_LS_S;

  transmit_NRZI_buffer[transmit_NRZI_buffer_cnt++] = USB_LS_J;
  transmit_NRZI_buffer[transmit_NRZI_buffer_cnt++] = USB_LS_J;
  transmit_NRZI_buffer[transmit_NRZI_buffer_cnt++] = USB_LS_J;
  transmit_NRZI_buffer[transmit_NRZI_buffer_cnt++] = USB_LS_J;

  transmit_bits_buffer_store_cnt = 0;
}



uint8_t rev8(uint8_t j)
{
  uint8_t res = 0;
  for(int i=0;i<8;i++) {
    res<<=1;
    res|=(j>>i)&1;
  }
  return res;
}



uint16_t rev16(uint16_t j)
{
  uint16_t res = 0;
  for(int i=0;i<16;i++) {
    res<<=1;
    res|=(j>>i)&1;
  }
  return res;
}



#ifdef DEBUG_ALL
uint16_t debug_buff[0x100];
#endif


void (*onLedBlinkCB)(int on_off) = NULL;
#define NOTIFY() if(onLedBlinkCB) onLedBlinkCB(1)


int parse_received_NRZI_buffer()
{

  if(!received_NRZI_buffer_bytesCnt) return 0;

  uint32_t   crcb;
  uint32_t   rem;

  crcb = 0b1000000000000101;
  rem =  0b1111111111111111;

  int  res = 0;
  int  cntOnes = 0;

  int terr  = 0;
  uint8_t  current_res = 0xfe;
  uint16_t prev = received_NRZI_buffer[0];
  int      start = -1;
  uint8_t  prev_smb = M_ONE;
#ifdef DEBUG_ALL
  debug_buff[0] = received_NRZI_buffer_bytesCnt;
  uint8_t rcnt = 1;
  debug_buff[received_NRZI_buffer_bytesCnt] = 0xff;
#endif
  for(int i = 1;i<received_NRZI_buffer_bytesCnt;i++) {
    //define 2.5
    uint16_t curr = (prev&0xff00) + (((received_NRZI_buffer[i] - prev))&0xff);
    prev          = received_NRZI_buffer[i];

    uint8_t smb = curr>>8;
    int tm = (curr&0xff);
    //debug_buff[i] = tm | (smb<<8);
    if( tm<2  || (smb == 0) ) {
      //terr+=tm<4?tm : 4;
      terr+=tm;
    } else {
      //terr = 0;
      int delta = ((((curr+terr)&0xff))*TIME_MULT+TIME_SCALE/2)/TIME_SCALE;

      for(int k=0;k<delta;k++) {
        int incc = 1;

        if(prev_smb!=smb) {
          if(cntOnes!=6) {
            current_res = current_res*2+0;
          } else {
            incc = 0;
          }
          cntOnes = 0;
        } else {
          current_res = current_res*2+1;
          cntOnes++;
        }
        if(start>=0) {
          start+=incc;
        }
        if(current_res==0x1 && start<0 ) {
          start = 0;
        }
        if( (start&0x7) == 0 && incc) {
          if(start==8) {
            res = current_res;
          }
          #ifdef DEBUG_ALL
            debug_buff[rcnt++] = current_res;
          #endif
    //NOTIFY();
          decoded_receive_buffer_put(current_res);
          if(start>8) {
            for(int bt =0;bt<8;bt++) {
              int rb = (rem>>15)&1;
              rem   =  (rem<<1)&0b1111111111111111;
              if(rb^((current_res>>(7-bt))&1)) {
                rem ^= crcb;
              }
            }
          }
        }

        prev_smb = smb;
      }
      terr = 0;
    }
  }
  #ifdef DEBUG_ALL
    debug_buff[rcnt++] = 0xff;
  #endif
  rem &=0b1111111111111111;
  if (rem==0b1111111111111111) {
    return res;
  }
  if(rem==0x800d) {
    return  T_NEED_ACK;
  } else {
    return  T_CHK_ERR;
  }
}



//#define WR_SIMULTA
void sendOnly()
{
  uint8_t k;
  SET_O(DP_PIN, DM_PIN);
  #ifdef WR_SIMULTA
    uint32_t out_base = GPIO.out;
    sndA[0] = (out_base | DP) &~DM;
    sndA[1] = (out_base | DM) &~DP;
    sndA[2] = (out_base )&~(DP | DM);
    sndA[3] = out_base | (DM | DP);
  #endif
  for(k=0;k<transmit_NRZI_buffer_cnt;k++) {
    //usb_transmit_delay(10);
    cpuDelay(TRANSMIT_TIME_DELAY);
    hal_set_differential_gpio_value(DP_PIN, DM_PIN, transmit_NRZI_buffer[k]);
  }
  restart();
  SET_I(DP_PIN, DM_PIN);
}

void sendRecieveNParse()
{
  register uint32_t R3;
  register uint16_t *STORE = received_NRZI_buffer;
  //hal_disable_irq(); //this is already in IRQ handler
  sendOnly();
  register uint32_t R4;// = READ_BOTH_PINS;

START:
  R4 = READ_BOTH_PINS;
  *STORE = R4 | _getCycleCount8d8();
  STORE++;
  R3 = R4;
  //R4 = READ_BOTH_PINS;
  //if(R4!=R3)  goto START;
  if( R3 ) {
    for(int k=0;k<TOUT;k++) {
      R4   = READ_BOTH_PINS;
      if(R4!=R3)  goto START;
    }
  }
  //hal_enable_irq();
  received_NRZI_buffer_bytesCnt = STORE-received_NRZI_buffer;

  //early activation for debugging
  //if(received_NRZI_buffer_bytesCnt > 13) NOTIFY();
}



int sendRecieve()
{
  sendRecieveNParse();
  return parse_received_NRZI_buffer();
}



