tobozo/ESP32-USB-Soft-Host/src/usb_host.c
void SOF()
{
  if(1) {
    repack();
  }
  sendOnly();
}



void pu_Addr(uint8_t cmd,uint8_t addr,uint8_t eop)
{
  pu_MSB(T_START,8);
  pu_MSB(cmd,8);//setup
  pu_LSB(addr,7);
  pu_LSB(eop,4);
  pu_MSB(cal5(),5);
  repack();
}



void pu_ShortCmd(uint8_t cmd)
{
  pu_MSB(T_START,8);
  pu_MSB(cmd,8);//setup
  pu_MSB(0,16);
  repack();
}



void pu_Cmd(uint8_t cmd,uint8_t bmRequestType, uint8_t bmRequest,uint16_t wValue,uint16_t wIndex,uint16_t wLen)
{
  pu_MSB(T_START,8);
  pu_MSB(cmd,8);//setup
  pu_LSB(bmRequestType,8);
  pu_LSB(bmRequest,8);
  pu_LSB(wValue,16);
  pu_LSB(wIndex,16);
  pu_LSB(wLen,16);
  pu_MSB(cal16(),16);
  repack();
}



uint8_t ACK_BUFF[0x20];
int ACK_BUFF_CNT = 0;


void ACK()
{
  transmit_NRZI_buffer_cnt =0;
  if(ACK_BUFF_CNT==0) {
    pu_MSB(T_START,8);
    pu_MSB(T_ACK,8);// ack
    repack();
    memcpy(ACK_BUFF,transmit_NRZI_buffer,transmit_NRZI_buffer_cnt);
    ACK_BUFF_CNT = transmit_NRZI_buffer_cnt;
  } else {
    memcpy(transmit_NRZI_buffer,ACK_BUFF,ACK_BUFF_CNT);
    transmit_NRZI_buffer_cnt = ACK_BUFF_CNT;
  }
  sendOnly();
}


void timerCallBack()
{
  decoded_receive_buffer_clear();

  if(current->cb_Cmd==CB_CHECK) {
    SET_I(DP_PIN, DM_PIN);
    current->wires_last_state = READ_BOTH_PINS>>8;
    if(current->wires_last_state==M_ONE) {
      //NOTIFY(); //passes here
      // low speed
    } else if(current->wires_last_state==P_ONE) {
      //high speed
    } else if(current->wires_last_state==0x00) {
      // not connected
    } else if(current->wires_last_state== (M_ONE + P_ONE) ) {
      //????
    }
    current->bComplete = 1;
  } else if (current->cb_Cmd==CB_RESET) {
    SOF();
    sendRecieveNParse();
    SET_O(DP_PIN, DM_PIN);
    SE_0;
    current->cmdTimeOut  =   31;
    current->cb_Cmd         =   CB_WAIT0;
  } else if (current->cb_Cmd==CB_WAIT0) {
    if(current->cmdTimeOut>0) {
      current->cmdTimeOut--;
    } else {
      //sendRecieveNParse();
      current->bComplete     = 1;
    }
  } else if (current->cb_Cmd==CB_WAIT1) {
    SOF();
    if(current->cmdTimeOut>0) {
      current->cmdTimeOut--;
    } else {
      sendRecieveNParse();
      current->wires_last_state = READ_BOTH_PINS>>8;
      current->bComplete     = 1;
    }
  } else if (current->cb_Cmd==CB_POWER) {
    // for TEST
    #ifdef TEST
      SOF();
      sendRecieve();
      SOF();
      SOF();
    #else
      SET_O(DP_PIN, DM_PIN);
      SE_J; //this seems to prepare output pins value for the next use
      SET_I(DP_PIN, DM_PIN);
      current->cmdTimeOut  =    2;
      current->cb_Cmd  = CB_WAIT1;
    #endif
  } else if (current->cb_Cmd==CB_TICK) {
    SOF();
    current->bComplete     =         1;
  } else if(current->cb_Cmd==CB_3) {
    SOF();
    pu_Addr(current->rq.cmd,current->rq.addr,current->rq.eop);
    pu_Cmd(current->rq.dataCmd, current->rq.bmRequestType, current->rq.bmRequest,current->rq.wValue, current->rq.wIndex, current->rq.wLen);
    int res = sendRecieve();
    if(res==T_ACK) {
      current->cb_Cmd=CB_4;
      current->numb_reps_errors_allowed = 8;
      return ;
    } else {
      current->numb_reps_errors_allowed--;
      if(current->numb_reps_errors_allowed>0) {
        return ;
      } else {
        current->cb_Cmd=CB_TICK;
        current->bComplete = 1;
      }
    }
  } else if(current->cb_Cmd==CB_4) {
    SOF();
    pu_Addr(T_OUT,current->rq.addr,current->rq.eop);
    //reB();
    pu_MSB(T_START,8);
    pu_MSB(T_DATA1,8);//setup
    for(int k=0;k<current->transmitL1Bytes;k++) {
      pu_LSB(current->transmitL1[k],8);
    }
    pu_MSB(cal16(),16);
    repack();
    sendRecieveNParse();
    pu_Addr(T_IN,current->rq.addr,current->rq.eop);
    //setup
    sendRecieveNParse();
    if(received_NRZI_buffer_bytesCnt<SMALL_NO_DATA &&  received_NRZI_buffer_bytesCnt >SMALL_NO_DATA/4) {
      ACK();
    } else {
      current->numb_reps_errors_allowed--;
      if(current->numb_reps_errors_allowed>0) {
        return;
      } else {

      }
    }
    current->cb_Cmd=CB_TICK;
    current->bComplete = 1;
  } else if(current->cb_Cmd==CB_5) {
    SOF();
    pu_Addr(current->rq.cmd,current->rq.addr,current->rq.eop);
    pu_Cmd(current->rq.dataCmd, current->rq.bmRequestType, current->rq.bmRequest,current->rq.wValue, current->rq.wIndex, current->rq.wLen);
    sendRecieveNParse();

    int res = parse_received_NRZI_buffer();
    if(res==T_ACK) {
      current->cb_Cmd = CB_6;
      current->in_data_flip_flop = 1;
      current->numb_reps_errors_allowed = 4;
      current->counterAck ++;
      return ;
    } else {
      //SOF();
      current->counterNAck ++;
      current->numb_reps_errors_allowed--;
      if(current->numb_reps_errors_allowed>0) {
        // current->cb_Cmd = CB_TICK;
        current->acc_decoded_resp_counter = 0;
        return ;
      } else {
        current->cb_Cmd = CB_TICK;
        current->bComplete       =  1;
      }
    }
  } else if(current->cb_Cmd==CB_6) {
    SOF();
    pu_Addr(T_IN,current->rq.addr,current->rq.eop);
    //setup
    sendRecieveNParse();
    // if receive something ??
    if(current->asckedReceiveBytes==0 && current->acc_decoded_resp_counter==0 && received_NRZI_buffer_bytesCnt<SMALL_NO_DATA &&  received_NRZI_buffer_bytesCnt >SMALL_NO_DATA/4 ) {
      ACK();

      current->cb_Cmd = CB_TICK;
      current->bComplete       =  1;
      return ;
    }
    int res = parse_received_NRZI_buffer();
    if(res == T_NEED_ACK) {
      //SOF();
      if(decoded_receive_buffer_size()>2) {
        decoded_receive_buffer_get();
        uint8_t sval = decoded_receive_buffer_get();
        if((current->in_data_flip_flop&1)==1) {
          if(sval==T_DATA1) {

          } else {
            current->cb_Cmd = CB_7;
            return ;
          }
        } else {
          if(sval==T_DATA0) {

          } else {
            current->cb_Cmd = CB_7;
            return ;
          }
        }
        current->in_data_flip_flop++;
        int bytes =decoded_receive_buffer_size()-2;
        for(int kk=0;kk<bytes;kk++) {
          current->acc_decoded_resp[current->acc_decoded_resp_counter] = rev8(decoded_receive_buffer_get());
          current->acc_decoded_resp_counter++;
          current->asckedReceiveBytes--;
        }

        if(bytes<=0) {

          current->acc_decoded_resp_counter = 0;
          current->asckedReceiveBytes = 0;
          current->cb_Cmd = CB_TICK;
          current->bComplete = 1;
        } else {
          current->cb_Cmd = CB_7;
          return ;
        }
      } else {
        current->acc_decoded_resp_counter = 0;
        current->asckedReceiveBytes = 0;
        current->cb_Cmd = CB_TICK;
        current->bComplete = 1;
        return ;
      }
    } else {
      current->numb_reps_errors_allowed--;
      if(current->numb_reps_errors_allowed>0) {
        return ;
      } else {
        current->cb_Cmd = CB_TICK;
        current->bComplete = 1;
      }
    }
  } else if(current->cb_Cmd==CB_7) {
    SOF();
    pu_Addr(T_IN,current->rq.addr,current->rq.eop);
    //setup
    sendRecieveNParse();
    ACK();
    if(current->asckedReceiveBytes>0) {
      current->cb_Cmd = CB_6;
      return ;
    }
    current->cb_Cmd = CB_8;
  } else if(current->cb_Cmd==CB_8) {
    SOF();
    pu_Addr(T_OUT,current->rq.addr,current->rq.eop);
    pu_ShortCmd(T_DATA1);
    sendOnly();
    current->cb_Cmd = CB_TICK;
    current->bComplete = 1;
  } else if(current->cb_Cmd==CB_2Ack) {
    SOF();
    pu_Addr(T_IN,current->rq.addr,current->rq.eop);
    //setup
    sendRecieveNParse();
    if(received_NRZI_buffer_bytesCnt<SMALL_NO_DATA/2) {
      // no data , seems NAK or something like this
      current->cb_Cmd = CB_TICK;
      current->bComplete = 1;
      return ;
     }
    ACK();
    current->cb_Cmd = CB_TICK;
    current->bComplete = 1;
  } else if(current->cb_Cmd==CB_2) {
    SOF();
    pu_Addr(T_IN,current->rq.addr,current->rq.eop);
    //setup
    sendRecieveNParse();
    if(received_NRZI_buffer_bytesCnt<SMALL_NO_DATA/2) {
      // no data , seems NAK or something like this
      current->cb_Cmd = CB_TICK;
      current->bComplete = 1;
      return ;
    }
    int res = parse_received_NRZI_buffer();
    if(res==T_NEED_ACK) {
      if(decoded_receive_buffer_size()>2) {
        decoded_receive_buffer_get();
        decoded_receive_buffer_get();
        int bytes =decoded_receive_buffer_size()-2;
        for(int kk=0;kk<bytes;kk++) {
          current->acc_decoded_resp[current->acc_decoded_resp_counter] = rev8(decoded_receive_buffer_get());
          current->acc_decoded_resp_counter++;
          current->asckedReceiveBytes--;
        }
      }
      current->asckedReceiveBytes = 0;
      current->cb_Cmd=CB_2Ack;
      return ;
    } else {
      current->numb_reps_errors_allowed--;
      if(current->numb_reps_errors_allowed>0) {
        return ;
      } else {
        current->cb_Cmd = CB_TICK;
        current->bComplete = 1;
      }
    }
    current->cb_Cmd = CB_TICK;
    current->bComplete = 1;
    current->asckedReceiveBytes = 0;
  }
}



