tobozo/ESP32-USB-Soft-Host/src/usb_host.c
void Request( uint8_t cmd, uint8_t addr, uint8_t eop, uint8_t dataCmd,uint8_t bmRequestType, uint8_t bmRequest, uint16_t wValue, uint16_t wIndex, uint16_t wLen, uint16_t waitForBytes)
{
  current->rq.cmd  = cmd;
  current->rq.addr = addr;
  current->rq.eop  = eop;
  current->rq.dataCmd = dataCmd;
  current->rq.bmRequestType = bmRequestType;
  current->rq.bmRequest = bmRequest;
  current->rq.wValue = wValue;
  current->rq.wIndex = wIndex;
  current->rq.wLen = wLen;

  current->numb_reps_errors_allowed = 4;
  current->asckedReceiveBytes = waitForBytes;
  current->acc_decoded_resp_counter    = 0;
  current->cb_Cmd = CB_5;
}



void RequestSend(uint8_t cmd,   uint8_t addr,uint8_t eop, uint8_t  dataCmd,uint8_t bmRequestType, uint8_t bmRequest,uint16_t wValue,uint16_t wIndex,uint16_t wLen,uint16_t transmitL1Bytes,uint8_t* data)
{
  current->rq.cmd  = cmd;
  current->rq.addr = addr;
  current->rq.eop  = eop;
  current->rq.dataCmd = dataCmd;
  current->rq.bmRequestType = bmRequestType;
  current->rq.bmRequest = bmRequest;
  current->rq.wValue = wValue;
  current->rq.wIndex = wIndex;
  current->rq.wLen = wLen;
  current->transmitL1Bytes = transmitL1Bytes;
  for(int k=0;k<current->transmitL1Bytes;k++) {
    current->transmitL1[k] = data[k];
  }
  current->numb_reps_errors_allowed = 4;
  current->acc_decoded_resp_counter    = 0;
  current->cb_Cmd = CB_3;
}


void RequestIn(uint8_t cmd,   uint8_t addr,uint8_t eop,uint16_t waitForBytes)
{
  current->rq.cmd  = cmd;
  current->rq.addr = addr;
  current->rq.eop  = eop;
  current->numb_reps_errors_allowed = 4;
  current->asckedReceiveBytes = waitForBytes;
  current->acc_decoded_resp_counter    = 0;
  current->cb_Cmd = CB_2;
}


void (*usbMess)(uint8_t src,uint8_t len,uint8_t *data) = NULL;

void set_usb_mess_cb( onusbmesscb_t onUSBMessCb )
{
  usbMess = onUSBMessCb;
}


void (*onDetectCB)(uint8_t usbNum, void *device) = NULL;

void set_ondetect_cb( ondetectcb_t cb )
{
  onDetectCB = cb;
}


void set_onled_blink_cb( onledblinkcb_t cb )
{
  onLedBlinkCB = cb;
}


void fsm_Mashine()
{
  if(!current->bComplete) return;
  current->bComplete = 0;

  if(current->fsm_state == 0) {
    current->epCount = 0;
    current->cb_Cmd     = CB_CHECK;
    current->fsm_state   = 1;
  }
  if(current->fsm_state == 1) {
    //NOTIFY(); //passes here
    if(current->wires_last_state==M_ONE) { // if(1)
        //NOTIFY(); //passes here

      current->cmdTimeOut = 100+current->selfNum*73;
      current->cb_Cmd      = CB_WAIT0;
      current->fsm_state   = 2;
    } else {
      current->fsm_state   = 0;
      current->cb_Cmd      = CB_CHECK;
    }
  } else if(current->fsm_state==2) {
    //NOTIFY(); //passes here
    current->cb_Cmd       = CB_RESET;
    current->fsm_state    = 3;
  } else if(current->fsm_state==3) {
    //NOTIFY(); //passes here
    current->cb_Cmd       = CB_POWER;
    #ifdef TEST
      current->fsm_state    =  3;
    #else
      current->fsm_state    =  4;
    #endif
  } else if(current->fsm_state==4) {
    Request(T_SETUP,ZERO_USB_ADDRESS,0b0000,T_DATA0,0x80,0x6,0x0100,0x0000,0x0012,0x0012);
    current->fsm_state    = 5;
  } else if(current->fsm_state==5) {
    //NOTIFY(); //passes here
    if(current->acc_decoded_resp_counter==0x12) {
      memcpy(&current->desc,current->acc_decoded_resp,0x12);
      current->ufPrintDesc |= 1;
    } else {
    //NOTIFY(); //passes here
      if(current->numb_reps_errors_allowed<=0) {
        current->fsm_state    =  0;
        return;
      }
    }

    Request(T_SETUP,ZERO_USB_ADDRESS,0b0000,T_DATA0,0x00,0x5,0x0000+ASSIGNED_USB_ADDRESS,0x0000,0x0000,0x0000);
    current->fsm_state    =  6;

  } else if(current->fsm_state==6) {
    current->cmdTimeOut = 5;
    current->cb_Cmd       = CB_WAIT1;
    current->fsm_state    = 7;
  } else if(current->fsm_state==7) {
    Request(T_SETUP,ASSIGNED_USB_ADDRESS,0b0000,T_DATA0,0x80,0x6,0x0200,0x0000,0x0009,0x0009);
    current->fsm_state    = 8;
  } else if(current->fsm_state==8) {
    if(current->acc_decoded_resp_counter==0x9) {
      memcpy(&current->cfg,current->acc_decoded_resp,0x9);
      current->ufPrintDesc |= 2;
      Request(T_SETUP,ASSIGNED_USB_ADDRESS,0b0000,T_DATA0,0x80,0x6,0x0200,0x0000,current->cfg.wLength,current->cfg.wLength);
      current->fsm_state    = 9;
    } else {
      current->fsm_state    = 0;
      return;
    }
  } else if(current->fsm_state==9) {
    if(current->acc_decoded_resp_counter==current->cfg.wLength) {
      current->ufPrintDesc |= 4;
      current->descrBufferLen = current->acc_decoded_resp_counter;
      memcpy(current->descrBuffer,current->acc_decoded_resp,current->descrBufferLen);
      current->fsm_state    = 97;
    } else {
      current->cmdTimeOut = 5;
      current->cb_Cmd       = CB_WAIT1;
      current->fsm_state    = 7;
    }
  } else if(current->fsm_state==97) {
    Request(T_SETUP,ASSIGNED_USB_ADDRESS,0b0000,T_DATA0,0x00,0x9,0x0001,0x0000,0x0000,0x0000);
     current->fsm_state    = 98;
  } else if(current->fsm_state==98) {
    // config interfaces??
    Request(T_SETUP,ASSIGNED_USB_ADDRESS,0b0000,T_DATA0,0x21,0xa,0x0000,0x0000,0x0000,0x0000);
    current->fsm_state    = 99;
  } else if(current->fsm_state==99) {
    if(current->flags_new!=current->flags) {
      current->flags = current->flags_new;
      RequestSend(T_SETUP,ASSIGNED_USB_ADDRESS,0b0000,T_DATA0,0x21,0x9,0x0200,0x0000,0x0001,0x0001,&current->flags);
    }
    current->fsm_state    = 100;
  } else if(current->fsm_state==100) {
     if( onLedBlinkCB ) onLedBlinkCB(0);
     RequestIn(T_IN,  ASSIGNED_USB_ADDRESS,1,8);
     current->fsm_state    = 101;
  } else if(current->fsm_state==101) {
    if(current->acc_decoded_resp_counter>=1) {
      usbMess(current->selfNum*4+0,current->acc_decoded_resp_counter,current->acc_decoded_resp);
      if( onLedBlinkCB ) onLedBlinkCB(1);
    }
    if(current->epCount>=2) {
      RequestIn(T_IN,  ASSIGNED_USB_ADDRESS,2,8);
      current->fsm_state    = 102;
    } else {
      current->cmdTimeOut = 3;
      current->cb_Cmd        = CB_WAIT1;
      current->fsm_state      = 104;
     }
  } else if(current->fsm_state==102) {
     if(current->acc_decoded_resp_counter>=1) {
       usbMess(current->selfNum*4+1,current->acc_decoded_resp_counter,current->acc_decoded_resp);
       if( onLedBlinkCB ) onLedBlinkCB(1);
     }
    current->cmdTimeOut = 2;
    current->cb_Cmd        = CB_WAIT1;
    current->fsm_state      = 104;
  } else if (current->fsm_state==104) {
    current->cmdTimeOut = 4;
    current->cb_Cmd        = CB_WAIT1;
  #ifdef  DEBUG_REPEAT
    static int rcnt =0;
    rcnt++;  //
    if(  (rcnt&0xff)==0 ||  (current->wires_last_state!=M_ONE))
  #else
    if(current->wires_last_state!=M_ONE)
  #endif
    {
      current->fsm_state      = 0;
      return ;
    }
    current->fsm_state      = 99;
  } else {
    current->cmdTimeOut = 2;
    current->cb_Cmd        = CB_WAIT1;
    current->fsm_state      = 0;
  }
}



void setPins(int DPPin,int DMPin)
{
  DP_PIN = DPPin;
  DM_PIN = DMPin;
  int diff = DPPin - DMPin;
  if(abs(diff)>7) {
    printf("PIN DIFFERENCE MUST BE LESS 8!\n");
    return;
  }
  int MIN_PIN = (DPPin<DMPin)?DPPin:DMPin;

  DM_PIN_M   = (1 << DMPin);
  DP_PIN_M    = (1 << DPPin);
  RD_MASK    = (1<<DPPin)|(1<<DMPin);

