tobozo/ESP32-USB-Soft-Host/src/usb_host.c
  RD_SHIFT = MIN_PIN;
  M_ONE = 1<<(DM_PIN-MIN_PIN);
  P_ONE = 1<<(DP_PIN-MIN_PIN);

}


sUsbContStruct  current_usb[NUM_USB];


int checkPins(int dp,int dm)
{
  int diff = abs(dp-dm);
  if(diff>7||diff==0) {
    return 0;
  }
  if( dp<8 || dp>31) return 0;
  if( dm<8 || dm>31) return 0;

  return 1;
}


int64_t get_system_time_us()
{
  return micros(); 
}


float testDelay6(float freq_MHz)
{
  // 6 bits must take 4.0 uSec
  #define SEND_BITS  120
  #define REPS 40
  float res = 1;
  transmit_NRZI_buffer_cnt = 0;

  for(int k=0;k<SEND_BITS/2;k++) {
    transmit_NRZI_buffer[transmit_NRZI_buffer_cnt++] = USB_LS_K;
    transmit_NRZI_buffer[transmit_NRZI_buffer_cnt++] = USB_LS_J;
  }


  int64_t stimb = get_system_time_us();
  for(int k=0;k<REPS;k++) {
    sendOnly();
    transmit_NRZI_buffer_cnt = SEND_BITS;
  }

  uint32_t stim =  get_system_time_us()- stimb;
  freq_MHz = 1.0f;
  res = stim*6.0/freq_MHz/(SEND_BITS*REPS);
  printf("%d bits in %f uSec %f MHz  6 ticks in %f uS\n",(SEND_BITS*REPS),stim/(float)freq_MHz,(SEND_BITS*REPS)*freq_MHz/stim,stim*6.0/freq_MHz/(SEND_BITS*REPS));

  return res;
}

uint8_t arr[0x200];


void initStates(int DP0,int DM0,int DP1,int DM1,int DP2,int DM2,int DP3,int DM3)
{
  decoded_receive_buffer_head = 0;
  decoded_receive_buffer_tail = 0;
  transmit_bits_buffer_store_cnt = 0;

  int calibrated = 0;

  for(int k=0;k<NUM_USB;k++) {
    current = &current_usb[k];
    if(k==0) {
      current->DP = DP0;
      current->DM = DM0;
    } else if(k==1) {
      current->DP = DP1;
      current->DM = DM1;
    } else if(k==2) {
      current->DP = DP2;
      current->DM = DM2;
    } else if(k==3) {
      current->DP = DP3;
      current->DM = DM3;
    }
    current->isValid = 0;
    if(checkPins(current->DP,current->DM)) {
      printf("USB#%d (pins %d %d) is OK!\n", k, (int)current->DP, (int)current->DM );
      current->selfNum = k;
      current->flags_new  = 0x0;
      current->flags 		= 0x0;
      current->in_data_flip_flop       = 0;
      current->bComplete  = 1;
      current->cmdTimeOut = 0;
      current->ufPrintDesc =0;
      current->cb_Cmd     = CB_CHECK;
      current->fsm_state  = 0;
      current->wires_last_state = 0;
      current->counterNAck = 0;
      current->counterAck = 0;
      current->epCount = 0;
      hal_gpio_pad_select_gpio(current->DP);
      hal_gpio_set_direction(current->DP, GPIO_MODE_OUTPUT);
      hal_gpio_set_level(current->DP, 0);
      hal_gpio_set_direction(current->DP, GPIO_MODE_INPUT);
      hal_gpio_pulldown_en(current->DP);

      hal_gpio_pad_select_gpio(current->DM);
      hal_gpio_set_direction(current->DM, GPIO_MODE_OUTPUT);
      hal_gpio_set_level(current->DM, 0);
      hal_gpio_set_direction(current->DM, GPIO_MODE_INPUT);
      hal_gpio_pulldown_en(current->DM);
      current->isValid = 1;

      // TEST
      setPins(current->DP,current->DM);
      printf("READ_BOTH_PINS = %04x\n",READ_BOTH_PINS);
      SET_O(DP_PIN, DM_PIN);
      SE_0;
      SE_J;
      SE_0;
      SET_I(DP_PIN, DM_PIN);
      printf("READ_BOTH_PINS = %04x\n",READ_BOTH_PINS);
      hal_gpio_set_direction(current->DP, GPIO_MODE_OUTPUT);
      hal_gpio_set_direction(current->DM, GPIO_MODE_OUTPUT);
      printf("READ_BOTH_PINS = %04x\n",READ_BOTH_PINS);
      SET_I(DP_PIN, DM_PIN);
      printf("READ_BOTH_PINS = %04x\n",READ_BOTH_PINS);

      if(!calibrated) {
        //calibrate delay divide 2
        #define DELAY_CORR 2
        int freq_mhz = hal_get_cpu_mhz();
        int  uTime = freq_mhz+20;
        int  dTime = 0;
        printf("cpu freq = %d MHz\n", freq_mhz);
        TM_OUT = freq_mhz/2;
        // 8  - func divided clock to 8, 1.5 - MHz USB LS //NOTE: N=8 noy anymore constant, depends on clock frequency
        TIME_MULT = (int)(TIME_SCALE/(freq_mhz/(1<<TIME_FACTOR_BITS)/1.5)+0.5); //this fixes the timing bug!!
        printf("TIME_MULT = %d \n",TIME_MULT);

        int     TRANSMIT_TIME_DELAY_OPT = 0;
        TRANSMIT_TIME_DELAY = TRANSMIT_TIME_DELAY_OPT;
        printf("D=%4d ",TRANSMIT_TIME_DELAY);
        setDelay(TRANSMIT_TIME_DELAY);
        float  cS_opt = testDelay6(freq_mhz);
        #define OPT_TIME (4.00f)
        for(int p=0;p<9;p++) {
          TRANSMIT_TIME_DELAY = (uTime+dTime)/2;
          printf("D=%4d ",TRANSMIT_TIME_DELAY);
          setDelay(TRANSMIT_TIME_DELAY);
          float cS = testDelay6(freq_mhz);
          if(fabsf(OPT_TIME-cS)<fabsf(OPT_TIME-cS_opt)) {
            cS_opt = cS;
            TRANSMIT_TIME_DELAY_OPT = TRANSMIT_TIME_DELAY;
          }
          if(cS<OPT_TIME) {
            dTime = TRANSMIT_TIME_DELAY;
          } else {
            uTime = TRANSMIT_TIME_DELAY;
          }
        }
        TRANSMIT_TIME_DELAY = TRANSMIT_TIME_DELAY_OPT+DELAY_CORR;
        setDelay(TRANSMIT_TIME_DELAY);
        printf("TRANSMIT_TIME_DELAY = %d time = %f error = %f%% \n",TRANSMIT_TIME_DELAY,cS_opt,(cS_opt-OPT_TIME)/OPT_TIME*100);
      }
    } else {
      if( current->DP == -1 && current->DM == -1 ) {
#ifndef DEBUG_ALL
        printf("USB#%d is disabled by user configuration\n", k); //maybe called in interrupt handler for disabling the port
#endif
      } else {
        printf("USB#%d (pins %d %d) has errors and will be disabled !\n", k, (int)current->DP, (int)current->DM );
      }
    }
  }
}



void usbSetFlags(int _usb_num,uint8_t flags)
{
  if(_usb_num<NUM_USB&&_usb_num>=0) {
    current_usb[_usb_num].flags_new =  flags;
  }
}



uint8_t usbGetFlags(int _usb_num)
{
  if(_usb_num<NUM_USB&&_usb_num>=0) {
    return current_usb[_usb_num].flags;
  }
  return  0;
}



void usb_process()
{
  #if CONFIG_IDF_TARGET_ESP32C3 || defined ESP32C3
    cpu_ll_enable_cycle_count();
  #endif
  for(int k=0;k<NUM_USB;k++) {
    current = &current_usb[k];
    if(current->isValid) {
      setPins(current->DP,current->DM);
      timerCallBack();
      fsm_Mashine();
    }
  }
}



void printState()
{
  static int cntl = 0;
  cntl++;
  int ref = cntl%NUM_USB;
  sUsbContStruct * pcurrent = &current_usb[ref];
  if(!pcurrent->isValid) return ;
  if((cntl%800)<NUM_USB) {
    #ifdef DEBUG_ALL
      printf("USB%d: Ack = %d Nack = %d %02x pcurrent->cb_Cmd = %d  state = %d epCount = %d --",
        cntl%NUM_USB, pcurrent->counterAck,
        pcurrent->counterNAck,
        pcurrent->wires_last_state,
        pcurrent->cb_Cmd,
        pcurrent->fsm_state,
        pcurrent->epCount
      );
      for(int k=0;k<20;k++) {
        printf("%04x ", debug_buff[k]);
      }
      printf("\n");
    #endif
  }

  if(pcurrent->ufPrintDesc&1) {
    pcurrent->ufPrintDesc &= ~(uint32_t)1;
    if( onDetectCB ) {
      onDetectCB( ref, (void*)&pcurrent->desc );
    } else {
      printf("desc.bcdDevice       = %02x\n",pcurrent->desc.bcdDevice);
      printf("desc.iManufacturer   = %02x\n",pcurrent->desc.iManufacturer);
      printf("desc.iProduct        = %02x\n",pcurrent->desc.iProduct);
      printf("desc.iSerialNumber   = %02x\n",pcurrent->desc.iSerialNumber);
      printf("desc.bNumConfigurations = %02x\n",pcurrent->desc.bNumConfigurations);
    }

