tobozo/ESP32-USB-Soft-Host/src/usb_host.c
  }

  if(pcurrent->ufPrintDesc&2) {
    pcurrent->ufPrintDesc &= ~(uint32_t)2;
  }

  if(pcurrent->ufPrintDesc&4) {
    pcurrent->ufPrintDesc &= ~(uint32_t)4;
    HIDDescriptor hid[4];
    /*sCfgDesc lcfg;
    sIntfDesc sIntf;
    sEPDesc epd;
    int cfgCount   = 0;
    int sIntfCount   = 0;*/
    int hidCount   = 0;
    int pos = 0;
    #define STDCLASS        0x00
    #define HIDCLASS        0x03
    #define HUBCLASS     0x09      // bDeviceClass, bInterfaceClass
    #ifdef DEBUG_ALL
      printf("clear epCount %d self = %d\n",pcurrent->epCount,pcurrent->selfNum);
    #endif
    pcurrent->epCount     = 0;
    while(pos<pcurrent->descrBufferLen-2) {
      uint8_t len  =  pcurrent->descrBuffer[pos];
      uint8_t type =  pcurrent->descrBuffer[pos+1];
      if(len==0) {
        pos = pcurrent->descrBufferLen;
      }
      if(pos+len<=pcurrent->descrBufferLen) {
        //printf("\n");
        if(type == 0x2) {
          sCfgDesc cfg;
          memcpy(&cfg,&pcurrent->descrBuffer[pos],len);
          #ifdef DEBUG_ALL
            printf("cfg.wLength         = %02x\n",cfg.wLength);
            printf("cfg.bNumIntf        = %02x\n",cfg.bNumIntf);
            printf("cfg.bCV             = %02x\n",cfg.bCV);
            printf("cfg.bMaxPower       = %d\n",cfg.bMaxPower);
          #endif
        } else if (type == 0x4) {
          sIntfDesc sIntf;
          memcpy(&sIntf,&pcurrent->descrBuffer[pos],len);
        } else if (type == 0x21) {
          hidCount++;
          int i = hidCount-1;
          memcpy(&hid[i],&pcurrent->descrBuffer[pos],len);
        } else if (type == 0x5) {
          //pcurrent->epCount++;
          sEPDesc epd;
          memcpy(&epd,&pcurrent->descrBuffer[pos],len);
          #ifdef DEBUG_ALL
            printf("pcurrent->epCount = %d\n",pcurrent->epCount);
            printf("epd.bLength       = %02x\n",epd.bLength);
            printf("epd.bType         = %02x\n",epd.bType);
            printf("epd.bEPAdd        = %02x\n",epd.bEPAdd);
            printf("epd.bAttr         = %02x\n",epd.bAttr);
            printf("epd.wPayLoad      = %02x\n",epd.wPayLoad);
            printf("epd.bInterval     = %02x\n",epd.bInterval);
          #endif
        }
      }
      pos+=len;
    }
  }
}


#pragma GCC diagnostic pop


